Revit 2027 API
Outline.IsEmpty Property
 Identifies if the outline represents an empty outline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEmpty { get; }
Public ReadOnly Property IsEmpty As Boolean
	Get
public:
property bool IsEmpty {
	bool get ();
}
member IsEmpty : bool with get
Property Value
Boolean
See Also
Reference
Outline Class
Autodesk.Revit.DB Namespace